In [644]:
import pymysql
import pandas as pd

In [645]:
def push(query):
    try:
        connection = pymysql.connect(
            host='localhost',
            port=3306,
            user='root',
            password='lolik`12*-',
            database='stepik',
            cursorclass=pymysql.cursors.DictCursor,
        )
        print('Succesfully connect')
        print('#' * 20)

        try:
            with connection.cursor() as cursor:
                cursor.execute(query)
                print(f'{' '.join(query.split()[:2])} succesfully')
                if query.split()[0].lower() == 'select':
                    return cursor
                if query.split()[0].lower() in ['insert', 'update', 'delete']:
                    connection.commit()

        finally:
            connection.close()

    except Exception as ex:
        print('Connection refused...')
        print(ex)

In [646]:
# Команды из набора DDL – Data Definition Language (язык описания данных):
# ALTER
# CREATE
# DROP

# Команды из набора DML – Data Manipulation Language (язык манипулирования данными):
# SELECT – выборка данных
# INSERT – вставка новых данных
# UPDATE – обновление данных
# DELETE – удаление данных
# MERGE – слияние данных

# 2. Проектирование БД (команды DDL)

In [647]:
# Удаление таблицы
drop_table_query = 'DROP TABLE IF EXISTS users'
push(drop_table_query)

Succesfully connect
####################
Connection refused...
(3730, "Cannot drop table 'users' referenced by a foreign key constraint 'groups_ibfk_1' on table 'groups'.")

In [648]:
# Создание таблицы users
create_table_query = """
CREATE TABLE users(
    id BIGINT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    firstname VARCHAR(100),
    lastname VARCHAR(100) COMMENT 'фамилия',
    login VARCHAR(100),
    email VARCHAR(100) UNIQUE,
    password_hash VARCHAR(256),
    phone BIGINT UNSIGNED UNIQUE,
    
    INDEX idx_users_username(firstname, lastname)
) COMMENT 'пользователи';"""

push(create_table_query)

Succesfully connect
####################
Connection refused...
(1050, "Table 'users' already exists")

In [649]:
# Удаление таблицы
drop_table_query = 'DROP TABLE IF EXISTS user_settings'
push(drop_table_query)

Succesfully connect
####################
DROP TABLE succesfully

In [650]:
# Создание таблицы user_settings

# 1 x 1
create_table_query = """
CREATE TABLE user_settings(
    user_id BIGINT UNSIGNED NOT NULL,
    is_premium_account BIT,
    is_night_mode_enabled BIT,
    color_scheme ENUM('classic', 'day', 'tinted', 'night'),
    LANGUAGE ENUM('english', 'french', 'russian', 'german', 'belorussian', 'croatian', 'dutch'),
    status_text VARCHAR(70),
    notifications_and_sounds JSON,
    created_at DATETIME DEFAULT NOW()
);"""

push(create_table_query)

Succesfully connect
####################
CREATE TABLE succesfully

In [651]:
# Создание связи с таблицами user_settings и users
alter_table_query = """
ALTER TABLE user_settings ADD CONSTRAINT fk_user_settings_user_id
FOREIGN KEY (user_id) REFERENCES users(id)
ON UPDATE CASCADE
ON DELETE RESTRICT;
"""

push(alter_table_query)

Succesfully connect
####################
ALTER TABLE succesfully

In [652]:
# Добавление строки в таблицу users

# insert_query = "INSERT INTO users (id, firstname, lastname, email, phone) VALUES ('2', 'Kelsie', 'Olson', 'xheidenereich@example.net', '9548489264');"

# можно не указывать автоинкрементное (AUTO_INCREMENT) поле
insert_query = """INSERT INTO users (firstname, lastname, email, phone) VALUES
('Ozella', 'Hauck', 'idickens@example.com', '9773438197'),
('Emmet', 'Hammes', 'qcremin@example.org', '9694110645'),
('Lori', 'Koch', 'damaris34@example.net', '9192291407'),
('Sam', 'Kuphal', 'telly.miller@example.net', '9917826315');"""

push(insert_query)

Succesfully connect
####################
Connection refused...
(1062, "Duplicate entry 'idickens@example.com' for key 'users.email'")

In [653]:
# Запрос селект
select_query = 'SELECT * FROM users'
rows = push(select_query).fetchall()
for row in rows:
    print(row)

Succesfully connect
####################
SELECT * succesfully
{'id': 1, 'firstname': 'Kelsie', 'lastname': 'Olson', 'login': None, 'email': 'xheidenreich@example.net', 'password_hash': None, 'phone': 9548492646, 'is_deleted': b'\x00'}
{'id': 2, 'firstname': 'Lucile', 'lastname': 'Rolfson', 'login': None, 'email': 'dbartell@example.net', 'password_hash': None, 'phone': 9258387168, 'is_deleted': b'\x00'}
{'id': 3, 'firstname': 'Ozella', 'lastname': 'Hauck', 'login': None, 'email': 'idickens@example.com', 'password_hash': None, 'phone': 9773438197, 'is_deleted': b'\x00'}
{'id': 4, 'firstname': 'Emmet', 'lastname': 'Hammes', 'login': None, 'email': 'qcremin@example.org', 'password_hash': None, 'phone': 9694110645, 'is_deleted': b'\x00'}
{'id': 5, 'firstname': 'Lori', 'lastname': 'Koch', 'login': None, 'email': 'damaris34@example.net', 'password_hash': None, 'phone': 9192291407, 'is_deleted': b'\x00'}
{'id': 6, 'firstname': 'Sam', 'lastname': 'Kuphal', 'login': None, 'email': 'telly.miller@example.net', 'password_hash': None, 'phone': 9917826315, 'is_deleted': b'\x00'}
{'id': 39, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': 'flavio.hammes2@example.com', 'password_hash': None, 'phone': 9686686722, 'is_deleted': b'\x00'}
{'id': 93, 'firstname': 'Gregory', 'lastname': 'Jenkins', 'login': None, 'email': 'weimann.richard@example.com', 'password_hash': None, 'phone': 9860971258, 'is_deleted': b'\x00'}
{'id': 94, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}
{'id': 99, 'firstname': 'Miguel', 'lastname': 'Watsica', 'login': 'hassan_kuphal', 'email': 'hassan.kuphal@example.org', 'password_hash': None, 'phone': 9824696112, 'is_deleted': b'\x00'}
{'id': 100, 'firstname': 'Sam2', 'lastname': 'Kuphal2', 'login': None, 'email': 'telly.miller222@example.net', 'password_hash': None, 'phone': 9917826222, 'is_deleted': b'\x00'}
{'id': 106, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}
{'id': 118, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}
{'id': 130, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}
{'id': 142, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}
{'id': 154, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}
{'id': 166, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}
{'id': 178, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}
{'id': 190, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}
{'id': 202, 'firstname': 'Celestino', 'lastname': 'Cruickshank', 'login': None, 'email': None, 'password_hash': None, 'phone': None, 'is_deleted': b'\x00'}

In [654]:
# Удаление строк
drop_row_query = 'DELETE FROM users WHERE id IN (1, 2)'
push(drop_row_query)

Succesfully connect
####################
Connection refused...
(1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`stepik`.`channels`, CONSTRAINT `channels_ibfk_1` FOREIGN KEY (`owner_user_id`) REFERENCES `users` (`id`))')

In [655]:
# Добавление, изменение типа, переименование, удавление полей таблицы
add_column_query = "ALTER TABLE users ADD COLUMN birthday DATETIME"
push(add_column_query)

modify_column_query = "ALTER TABLE users MODIFY COLUMN birthday DATE"
push(modify_column_query)

rename_column_query = "ALTER TABLE users RENAME COLUMN birthday to date_of_birth"
push(rename_column_query)

drop_column_query = "ALTER TABLE users DROP COLUMN date_of_birth"
push(drop_column_query)

Succesfully connect
####################
ALTER TABLE succesfully
Succesfully connect
####################
ALTER TABLE succesfully
Succesfully connect
####################
ALTER TABLE succesfully
Succesfully connect
####################
ALTER TABLE succesfully

In [656]:
pd.DataFrame(rows)

,id,firstname,lastname,login,email,password_hash,phone,is_deleted
0,1,Kelsie,Olson,None,xheidenreich@example.net,None,9.548493e+09,b'\x00'
1,2,Lucile,Rolfson,None,dbartell@example.net,None,9.258387e+09,b'\x00'
2,3,Ozella,Hauck,None,idickens@example.com,None,9.773438e+09,b'\x00'
3,4,Emmet,Hammes,None,qcremin@example.org,None,9.694111e+09,b'\x00'
4,5,Lori,Koch,None,damaris34@example.net,None,9.192291e+09,b'\x00'
5,6,Sam,Kuphal,None,telly.miller@example.net,None,9.917826e+09,b'\x00'
6,39,Celestino,Cruickshank,None,flavio.hammes2@example.com,None,9.686687e+09,b'\x00'
7,93,Gregory,Jenkins,None,weimann.richard@example.com,None,9.860971e+09,b'\x00'
8,94,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
9,99,Miguel,Watsica,hassan_kuphal,hassan.kuphal@example.org,None,9.824696e+09,b'\x00'
10,100,Sam2,Kuphal2,None,telly.miller222@example.net,None,9.917826e+09,b'\x00'
11,106,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
12,118,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
13,130,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
14,142,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
15,154,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
16,166,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
17,178,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
18,190,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
19,202,Celestino,Cruickshank,None,None,None,NaN,b'\x00'

In [657]:
push('ALTER TABLE users ADD COLUMN birthday DATETIME')
rows = push('SELECT * FROM users').fetchall()
display(pd.DataFrame(rows))

push('ALTER TABLE users DROP COLUMN birthday')
rows = push('SELECT * FROM users').fetchall()
display(pd.DataFrame(rows))

Succesfully connect
####################
ALTER TABLE succesfully
Succesfully connect
####################
SELECT * succesfully

,id,firstname,lastname,login,email,password_hash,phone,is_deleted,birthday
0,1,Kelsie,Olson,None,xheidenreich@example.net,None,9.548493e+09,b'\x00',None
1,2,Lucile,Rolfson,None,dbartell@example.net,None,9.258387e+09,b'\x00',None
2,3,Ozella,Hauck,None,idickens@example.com,None,9.773438e+09,b'\x00',None
3,4,Emmet,Hammes,None,qcremin@example.org,None,9.694111e+09,b'\x00',None
4,5,Lori,Koch,None,damaris34@example.net,None,9.192291e+09,b'\x00',None
5,6,Sam,Kuphal,None,telly.miller@example.net,None,9.917826e+09,b'\x00',None
6,39,Celestino,Cruickshank,None,flavio.hammes2@example.com,None,9.686687e+09,b'\x00',None
7,93,Gregory,Jenkins,None,weimann.richard@example.com,None,9.860971e+09,b'\x00',None
8,94,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None
9,99,Miguel,Watsica,hassan_kuphal,hassan.kuphal@example.org,None,9.824696e+09,b'\x00',None
10,100,Sam2,Kuphal2,None,telly.miller222@example.net,None,9.917826e+09,b'\x00',None
11,106,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None
12,118,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None
13,130,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None
14,142,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None
15,154,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None
16,166,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None
17,178,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None
18,190,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None
19,202,Celestino,Cruickshank,None,None,None,NaN,b'\x00',None

Succesfully connect
####################
ALTER TABLE succesfully
Succesfully connect
####################
SELECT * succesfully

,id,firstname,lastname,login,email,password_hash,phone,is_deleted
0,1,Kelsie,Olson,None,xheidenreich@example.net,None,9.548493e+09,b'\x00'
1,2,Lucile,Rolfson,None,dbartell@example.net,None,9.258387e+09,b'\x00'
2,3,Ozella,Hauck,None,idickens@example.com,None,9.773438e+09,b'\x00'
3,4,Emmet,Hammes,None,qcremin@example.org,None,9.694111e+09,b'\x00'
4,5,Lori,Koch,None,damaris34@example.net,None,9.192291e+09,b'\x00'
5,6,Sam,Kuphal,None,telly.miller@example.net,None,9.917826e+09,b'\x00'
6,39,Celestino,Cruickshank,None,flavio.hammes2@example.com,None,9.686687e+09,b'\x00'
7,93,Gregory,Jenkins,None,weimann.richard@example.com,None,9.860971e+09,b'\x00'
8,94,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
9,99,Miguel,Watsica,hassan_kuphal,hassan.kuphal@example.org,None,9.824696e+09,b'\x00'
10,100,Sam2,Kuphal2,None,telly.miller222@example.net,None,9.917826e+09,b'\x00'
11,106,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
12,118,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
13,130,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
14,142,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
15,154,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
16,166,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
17,178,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
18,190,Celestino,Cruickshank,None,None,None,NaN,b'\x00'
19,202,Celestino,Cruickshank,None,None,None,NaN,b'\x00'

In [658]:
# Изменение полей в user_settings
add_property_query = "ALTER TABLE user_settings ADD PRIMARY KEY (user_id)"
push(add_property_query)

# modify_column_query = "ALTER TABLE user_settings MODIFY COLUMN user_id BIGINT UNSIGNED NOT NULL PRIMATY KEY"
# push(modify_column_query)

rename_column_query = "ALTER TABLE user_settings RENAME COLUMN LANGUAGE to app_language"
push(rename_column_query)

Succesfully connect
####################
ALTER TABLE succesfully
Succesfully connect
####################
ALTER TABLE succesfully

In [ ]:
# Создание таблицы private_messages

push('DROP TABLE IF EXISTS private_messages;')

# 1 x M
create_table_query = """
CREATE TABLE private_messages(
    id SERIAL,
    sender_id BIGINT UNSIGNED NOT NULL,
    receiver_id BIGINT UNSIGNED NOT NULL,
    reply_to_id BIGINT UNSIGNED NULL,
    media_type ENUM('text', 'image', 'audio', 'video'),
    body TEXT,
    filename VARCHAR(200),
    created_at DATETIME DEFAULT NOW(),

    FOREIGN KEY (sender_id) REFERENCES users(id),
    FOREIGN KEY (receiver_id) REFERENCES users(id),
    FOREIGN KEY (reply_to_id) REFERENCES private_messages(id)
);
"""
push(create_table_query)

Succesfully connect
####################
DROP TABLE succesfully
Succesfully connect
####################
CREATE TABLE succesfully

In [660]:
# Создание таблицы groups

push('DROP TABLE IF EXISTS `groups`;')

create_table_query = """
CREATE TABLE `groups` (
    id SERIAL,
    title VARCHAR(45),
    icon VARCHAR(45),
    invite_link VARCHAR(100),
    settings JSON,
    owner_user_id BIGINT UNSIGNED NOT NULL,
    is_private BIT,
    created_at DATETIME DEFAULT NOW(),

    FOREIGN KEY (owner_user_id) REFERENCES users (id)
);
"""

push(create_table_query)

Succesfully connect
####################
Connection refused...
(3730, "Cannot drop table 'groups' referenced by a foreign key constraint 'group_messages_ibfk_2' on table 'group_messages'.")
Succesfully connect
####################
Connection refused...
(1050, "Table 'groups' already exists")

In [661]:
# Создание таблицы group_messages

push('DROP TABLE IF EXISTS `group_messages`;')

create_table_query = """
CREATE TABLE `group_messages` (
    id SERIAL,
    group_id BIGINT UNSIGNED NOT NULL,
    sender_id BIGINT UNSIGNED NOT NULL,
    reply_to_id BIGINT UNSIGNED NULL,
    media_type ENUM('text', 'image', 'audio', 'video'),
    body TEXT,
    filename VARCHAR(100) NULL,
    created_at DATETIME DEFAULT NOW(),

    FOREIGN KEY (sender_id) REFERENCES users (id),
    FOREIGN KEY (group_id) REFERENCES `groups` (id),
    FOREIGN KEY (reply_to_id) REFERENCES group_messages (id)
);
"""
push(create_table_query)

Succesfully connect
####################
DROP TABLE succesfully
Succesfully connect
####################
CREATE TABLE succesfully

In [662]:
# Создание таблицы channels

push('DROP TABLE IF EXISTS `channels`;')

create_table_query = """
CREATE TABLE channels (
    id SERIAL,
    title VARCHAR(45),
    icon VARCHAR(45),
    invite_link VARCHAR(100),
    settings JSON,
    owner_user_id BIGINT UNSIGNED NOT NULL,
    is_private BIT,
    created_at DATETIME DEFAULT NOW(),
    
    FOREIGN KEY (owner_user_id) REFERENCES users (id)    
);
"""
push(create_table_query)

Succesfully connect
####################
Connection refused...
(3730, "Cannot drop table 'channels' referenced by a foreign key constraint 'channel_subscribers_ibfk_2' on table 'channel_subscribers'.")
Succesfully connect
####################
Connection refused...
(1050, "Table 'channels' already exists")

In [663]:
# Создание таблицы group_messages

push('DROP TABLE IF EXISTS `channel_subscribers`;')

# M x M
create_table_query = """
CREATE TABLE channel_subscribers (
    channel_id BIGINT UNSIGNED NOT NULL,
    user_id BIGINT UNSIGNED NOT NULL,
    status ENUM('requested', 'joined', 'left'),
    created_at DATETIME DEFAULT NOW(),
    updated_at DATETIME ON UPDATE CURRENT_TIMESTAMP,

    PRIMARY KEY (user_id, channel_id),
    FOREIGN KEY (user_id) REFERENCES users (id),
    FOREIGN KEY (channel_id) REFERENCES channels (id)
);
"""
push(create_table_query)

Succesfully connect
####################
DROP TABLE succesfully
Succesfully connect
####################
CREATE TABLE succesfully

In [664]:
# Создание таблицы group_messages

push('DROP TABLE IF EXISTS stories;')

create_table_query = """
CREATE TABLE stories (
    id SERIAL,
    user_id BIGINT UNSIGNED NOT NULL,
    caption VARCHAR(140),
    filename VARCHAR(100),
    views_count INT UNSIGNED,
    created_at DATETIME DEFAULT NOW(),

    FOREIGN KEY (user_id) REFERENCES users (id)
);
"""
push(create_table_query)

Succesfully connect
####################
Connection refused...
(3730, "Cannot drop table 'stories' referenced by a foreign key constraint 'stories_likes_ibfk_2' on table 'stories_likes'.")
Succesfully connect
####################
Connection refused...
(1050, "Table 'stories' already exists")

In [665]:
# Создание таблицы group_messages

push('DROP TABLE IF EXISTS stories_likes;')

create_table_query = """
CREATE TABLE stories_likes (
	id SERIAL,
	story_id BIGINT UNSIGNED NOT NULL,
	user_id BIGINT UNSIGNED NOT NULL,
	created_at DATETIME DEFAULT NOW(),

	FOREIGN KEY (user_id) REFERENCES users (id),		
	FOREIGN KEY (story_id) REFERENCES stories (id)
);"""

push(create_table_query)

Succesfully connect
####################
DROP TABLE succesfully
Succesfully connect
####################
CREATE TABLE succesfully

In [666]:
# В связи с активным развитием проекта принято архитектурное решение вынести информацию о языках приложения 
# из поля app_language в таблице user_settings в отдельную таблицу-справочник языков.

# Архитектор обосновывает решение тем, что при добавлении нового языка в платформу проще добавить новую строку в таблицу, 
# чем изменять существующее поле в таблице.

In [667]:
# Сначала создадим таблицу languages.

# Поля:
# id - целочисленный первичный ключ (для простоты договоримся использовать псевдотип SERIAL)
# name - строка, название языка (содержит только уникальные значения, не может быть пустым)

push('DROP TABLE IF EXISTS languages;')

create_table_query = """
CREATE TABLE languages (
    id SERIAL,
    name VARCHAR(100) NOT NULL UNIQUE
);
"""

push(create_table_query)

Succesfully connect
####################
DROP TABLE succesfully
Succesfully connect
####################
CREATE TABLE succesfully

In [668]:
# Теперь добавим новое поле language_id в таблицу user_settings.
# Тип данных нового поля должен строго совпадать с полем id в таблице languages.

add_column_query = """
ALTER TABLE user_settings 
ADD COLUMN language_id BIGINT UNSIGNED;
"""

push(add_column_query)

Succesfully connect
####################
ALTER TABLE succesfully

In [669]:
# Теперь необходимо сделать поле language_id в таблице user_settings внешним ключом, 
# ссылающимся на идентификатор строки в таблице languages.

add_foreign_key_query = """
ALTER TABLE user_settings
ADD CONSTRAINT fk_language_id_id
FOREIGN KEY (language_id) REFERENCES languages(id)
ON DELETE CASCADE
ON UPDATE CASCADE;
"""

push(add_foreign_key_query)

Succesfully connect
####################
ALTER TABLE succesfully

In [670]:
# Другие люди заполнили таблицу languages нужными данными и проставили правильные значения в поле language_id.
# Осталось удалить поле app_language из таблицы user_settings, потому что теперь оно лишь дублирует новый функционал.

drop_column_query = """
ALTER TABLE user_settings
DROP COLUMN app_language;
"""

push(drop_column_query)

Succesfully connect
####################
ALTER TABLE succesfully

# 3. Работа с данными (команды DML, CRUD)

## 3.1  Команда INSERT

In [671]:
# Очистка таблицы (пересоздаем)

truncate_query = 'TRUNCATE users'
push(truncate_query)

Succesfully connect
####################
Connection refused...
(1701, 'Cannot truncate a table referenced in a foreign key constraint (`stepik`.`groups`, CONSTRAINT `groups_ibfk_1`)')

In [672]:
# базовый вариант команды INSERT

insert_query = """
INSERT INTO users (id, firstname, lastname, email, phone)
VALUES ('1', 'Kelsie', 'Olson', 'xheidenreich@example.net', '9548492646');"""

push(insert_query)

Succesfully connect
####################
Connection refused...
(1062, "Duplicate entry '1' for key 'users.PRIMARY'")

In [673]:
# можно не указывать автоинкрементное (AUTO_INCREMENT) поле
insert_query = """
INSERT INTO users (firstname, lastname, email, phone)
VALUES ('Celestino', 'Cruickshank', 'flavio.hammes2@example.com', '9686686722');"""

push(insert_query)

Succesfully connect
####################
Connection refused...
(1062, "Duplicate entry 'flavio.hammes2@example.com' for key 'users.email'")

In [674]:
# идентификаторы можно добавлять не по порядку
insert_query = """
INSERT INTO users (id, firstname, lastname, email, phone)
VALUES ('93', 'Gregory', 'Jenkins', 'weimann.richard@example.com', '9860971258');"""

push(insert_query)

Succesfully connect
####################
Connection refused...
(1062, "Duplicate entry '93' for key 'users.PRIMARY'")

In [675]:
# добавим колонку is_deleted
add_column_query = "ALTER TABLE users ADD COLUMN is_deleted BIT DEFAULT 0;"

push(add_column_query)

Succesfully connect
####################
Connection refused...
(1060, "Duplicate column name 'is_deleted'")

In [676]:
# значение по умолчанию для поля is_deleted
insert_query = """
INSERT INTO users (firstname, lastname, is_deleted)
VALUES ('Celestino', 'Cruickshank', DEFAULT);"""

push(insert_query)

Succesfully connect
####################
INSERT INTO succesfully

In [677]:
# не указываем имена полей - рабочий вариант
insert_query = """
INSERT INTO users
VALUES (101, 'Eleonore', 'Ward', NULL, 'antonietta333@example.com',DEFAULT, 9397815333, '2000.01.01', 0);"""

push(insert_query)

Succesfully connect
####################
Connection refused...
(1136, "Column count doesn't match value count at row 1")

In [678]:
# пакетная вставка данных - работает быстро (одиночная вставка данных - работает медленно)
insert_query = """
INSERT INTO users (firstname, lastname, email, phone) VALUES
('Ozella', 'Hauck', 'idickens@example.com', '9773438197'),
('Emmet', 'Hammes', 'qcremin@example.org', '9694110645'),
('Lori', 'Koch', 'damaris34@example.net', '9192291407'),
('Sam', 'Kuphal', 'telly.miller@example.net', '9917826315');"""

push(insert_query)

Succesfully connect
####################
Connection refused...
(1062, "Duplicate entry 'idickens@example.com' for key 'users.email'")

In [679]:
# второй вариант команды INSERT (можно вставить только 1 строку)
insert_query = """
INSERT INTO users
SET
    firstname = 'Miguel',
    lastname = 'Watsica',
    email = 'hassan.kuphal@example.org',
    login = 'hassan_kuphal',
    phone = '9824696112'
;"""

push(insert_query)

Succesfully connect
####################
Connection refused...
(1062, "Duplicate entry 'hassan.kuphal@example.org' for key 'users.email'")

In [680]:
# INSERT-SELECT
insert_query = """
INSERT INTO users
    (firstname, lastname, email, phone)
SELECT
    'Sam2', 'Kuphal2', 'telly.miller222@example.net', '9917826222';"""

push(insert_query)

Succesfully connect
####################
Connection refused...
(1062, "Duplicate entry 'telly.miller222@example.net' for key 'users.email'")

In [681]:
# опция ON DUPLICATE KEY UPDATE позволяет выполнить обновление
insert_query = """
INSERT INTO users (id, firstname, lastname, email, phone)
VALUES (2, 'Lucile', 'Rolfson', 'dbartell@example.net', 9258387168)
ON DUPLICATE KEY UPDATE
    firstname = 'Lucile',
    lastname = 'Rolfson',
    email = 'dbartell@example.net',
    phone = 9258387168
;"""

push(insert_query)

Succesfully connect
####################
INSERT INTO succesfully

## 3.2 Команда SELECT

In [682]:
# Вывод текста:
select_query = "SELECT 'Hello world';"

push(select_query)

Succesfully connect
####################
SELECT 'Hello succesfully

In [683]:
# вывести всю таблицу users (все поля, все строки):
select_query = """
SELECT *
FROM users;"""

pd.DataFrame(push(select_query)).head(5)

Succesfully connect
####################
SELECT * succesfully

,id,firstname,lastname,login,email,password_hash,phone,is_deleted
0,1,Kelsie,Olson,None,xheidenreich@example.net,None,9.548493e+09,b'\x00'
1,2,Lucile,Rolfson,None,dbartell@example.net,None,9.258387e+09,b'\x00'
2,3,Ozella,Hauck,None,idickens@example.com,None,9.773438e+09,b'\x00'
3,4,Emmet,Hammes,None,qcremin@example.org,None,9.694111e+09,b'\x00'
4,5,Lori,Koch,None,damaris34@example.net,None,9.192291e+09,b'\x00'

In [684]:
# явно указываем поля, которые необходимо вывести:
select_query = """
SELECT id, firstname , lastname , login , email , password_hash , phone, is_deleted
FROM users;"""

pd.DataFrame(push(select_query)).head(5)

Succesfully connect
####################
SELECT id, succesfully

,id,firstname,lastname,login,email,password_hash,phone,is_deleted
0,1,Kelsie,Olson,None,xheidenreich@example.net,None,9.548493e+09,b'\x00'
1,2,Lucile,Rolfson,None,dbartell@example.net,None,9.258387e+09,b'\x00'
2,3,Ozella,Hauck,None,idickens@example.com,None,9.773438e+09,b'\x00'
3,4,Emmet,Hammes,None,qcremin@example.org,None,9.694111e+09,b'\x00'
4,5,Lori,Koch,None,damaris34@example.net,None,9.192291e+09,b'\x00'

In [685]:
# выводим пользователя по его идентификатору (с лимитом 10 с сортировкой по имени):
select_query = """
SELECT *
FROM users
WHERE id < 5 or id IN (5, 7)
ORDER BY firstname DESC
LIMIT 10;"""

pd.DataFrame(push(select_query))

Succesfully connect
####################
SELECT * succesfully

,id,firstname,lastname,login,email,password_hash,phone,is_deleted
0,3,Ozella,Hauck,None,idickens@example.com,None,9773438197,b'\x00'
1,2,Lucile,Rolfson,None,dbartell@example.net,None,9258387168,b'\x00'
2,5,Lori,Koch,None,damaris34@example.net,None,9192291407,b'\x00'
3,1,Kelsie,Olson,None,xheidenreich@example.net,None,9548492646,b'\x00'
4,4,Emmet,Hammes,None,qcremin@example.org,None,9694110645,b'\x00'

In [686]:
# выводим количество строк с указанным именем:
select_query = """
SELECT count(firstname)
FROM users;"""

pd.DataFrame(push(select_query))

Succesfully connect
####################
SELECT count(firstname) succesfully

   count(firstname)
0                21

In [687]:
# выводим количество строк с уникальными именами:
select_query = """
SELECT count(DISTINCT firstname) as DISTINCT_COUNT
FROM users;"""

pd.DataFrame(push(select_query))

Succesfully connect
####################
SELECT count(DISTINCT succesfully

   DISTINCT_COUNT
0              10

## 3.3 Команда UPDATE

In [688]:
# вставим новую строку в таблицу channels
# (создадим новый канал)

push("""INSERT INTO channels(title, invite_link, owner_user_id, is_private)
VALUES ('MySQL news', 'https://t.me/mysql_news', 1, true);""")

Succesfully connect
####################
INSERT INTO succesfully

In [689]:
# вставим новые строки в таблицу channel_subscribers
# (пользователи отправляют заявки на вступление в канал)
push("""INSERT INTO channel_subscribers(channel_id, user_id, status)
VALUES (1, 2, 'requested');""")
     
push("""INSERT INTO channel_subscribers(channel_id, user_id, status)
VALUES (1, 3, 'requested');""")

push("""INSERT INTO channel_subscribers(channel_id, user_id, status)
VALUES (1, 4, 'requested');""")

Succesfully connect
####################
INSERT INTO succesfully
Succesfully connect
####################
INSERT INTO succesfully
Succesfully connect
####################
INSERT INTO succesfully

In [690]:
# обновит все строки в таблице channel_subscribers (плохо!)
push("""UPDATE channel_subscribers
SET
    status = 'joined';""")

Succesfully connect
####################
UPDATE channel_subscribers succesfully

In [691]:
# админ подтверждает добавление подписчика в канал
push("""UPDATE channel_subscribers
SET
    status = 'joined'
WHERE channel_id = 1 AND user_id = 2;""")

push("""UPDATE channel_subscribers
SET
    status = 'joined'
WHERE channel_id = 1 AND user_id = 3;""")

Succesfully connect
####################
UPDATE channel_subscribers succesfully
Succesfully connect
####################
UPDATE channel_subscribers succesfully

In [692]:
# пользователь покидает канал
push("""UPDATE channel_subscribers
SET
    status = 'left'
WHERE channel_id = 1 AND user_id = 2;""")

Succesfully connect
####################
UPDATE channel_subscribers succesfully

In [693]:
# добавим новый статус 'удален'
push("""ALTER TABLE channel_subscribers
MODIFY COLUMN status ENUM('requested', 'joined', 'left', 'removed');""")

Succesfully connect
####################
ALTER TABLE succesfully

In [694]:
# пользователя принудительно удалили из канала
push("""UPDATE channel_subscribers
SET
    status = 'removed'
WHERE channel_id = 1 AND user_id = 4;""")

Succesfully connect
####################
UPDATE channel_subscribers succesfully

In [695]:
# переименуем канал
push("""UPDATE channels
SET title = 'General SQL news'
WHERE id = 1;""")

Succesfully connect
####################
UPDATE channels succesfully

In [696]:
pd.DataFrame(push("SELECT * FROM channel_subscribers"))

Succesfully connect
####################
SELECT * succesfully

   channel_id  user_id   status          created_at          updated_at
0           1        2     left 2025-03-12 21:18:27 2025-03-12 21:18:27
1           1        3   joined 2025-03-12 21:18:27 2025-03-12 21:18:27
2           1        4  removed 2025-03-12 21:18:27 2025-03-12 21:18:27

## 3.4 Команда DELETE

In [697]:
# удаляем все строки из таблицы сообщений 
# (очищает данные, индексация сохраняется после удаления данных)
push("DELETE FROM private_messages;")

Succesfully connect
####################
DELETE FROM succesfully

In [698]:
# пересоздаем таблицу сообщений (DROP-CREATE)
# (пересоздается таблица, индексация следовательно обнуляется)
push("TRUNCATE private_messages;")

Succesfully connect
####################
TRUNCATE private_messages; succesfully

In [699]:
# подготовка данных (добавляем несколько сообщений между пользователями)
insert_query = """
INSERT INTO `private_messages`(sender_id, receiver_id, media_type, body, filename, created_at)
VALUES
(1,2,'text','Eveniet suscipit ullam occaecati consequatur hic. Nulla est in molestiae odit. Placeat perferendis consequatur qui omnis id vel autem.','officiis','2010-04-07 09:01:02'),
(2,1,'audio','Non repudiandae maiores molestiae vel doloribus. Quis facere blanditiis est magnam est ut vero.','qui','1971-05-29 07:31:20'),
(1,3,'text','Voluptas qui consequatur quae sunt et consequatur. Rem alias sed cupiditate explicabo voluptate. Officiis repellat porro accusamus eveniet quos. Laborum dolores sed enim aut.','excepturi','1998-10-28 20:08:01'),
(1,4,'video','Est delectus tempora exercitationem atque tempora reiciendis nulla voluptatem. Cupiditate non fugit blanditiis quasi ad et autem expedita. Aut est provident odio quasi possimus.','vitae','2001-12-03 15:54:43'),
(1,2,'video','Est ducimus amet et asperiores. Reiciendis debitis qui ipsa. Nemo laboriosam ea aut omnis voluptates quisquam accusantium. Quibusdam totam similique aut.','optio','1970-09-18 20:39:35'),
(1,2,'video','Quis cupiditate quis maxime et placeat consectetur ut quis. Voluptas unde voluptatem deserunt in dolorum maxime. Sunt fugiat sit tenetur placeat at.','laboriosam','1980-05-11 03:39:43'),
(2,1,'audio','Voluptatum nihil rem laboriosam delectus aperiam consequuntur et modi. Laudantium molestias corporis quo omnis ut ea. At minima iure et voluptatum culpa deleniti non. Sint laboriosam molestias dolor vel. Quibusdam omnis quas ullam dolor.','sit','1988-08-19 10:30:44'),
(2,4,'audio','Nemo eos sed aspernatur voluptates perspiciatis tenetur. Voluptas sunt magnam vero nam earum. Magnam eum vitae qui. Vel atque accusantium in non rem non et.','consectetur','1984-06-28 16:22:44'),
(4,5,'audio','Quod nihil possimus id qui. Quasi officia rerum eum doloribus est voluptas maxime. Et debitis enim non enim fugit.','repellat','1981-12-11 16:04:11'),
(3,1,'text','Qui voluptatem earum temporibus rem vel sequi. Et quasi vel qui est autem aliquam. Modi est voluptatem aut rerum ea velit. Voluptate et eligendi debitis nostrum nihil dolorum.','nihil','1988-02-16 13:29:14'),
(3,2,'image','Rem et ullam cum vitae autem reprehenderit quia. Enim a ipsam id ut aliquam est error. Quis dolorum omnis expedita eaque maiores illo.','et','2015-04-07 18:02:42')
;"""

push(insert_query)

Succesfully connect
####################
INSERT INTO succesfully

In [700]:
pd.DataFrame(push("SELECT * FROM private_messages"))

Succesfully connect
####################
SELECT * succesfully

,id,sender_id,receiver_id,reply_to_id,media_type,body,filename,created_at
0,1,1,2,None,text,Eveniet suscipit ullam occaecati consequatur h...,officiis,2010-04-07 09:01:02
1,2,2,1,None,audio,Non repudiandae maiores molestiae vel doloribu...,qui,1971-05-29 07:31:20
2,3,1,3,None,text,Voluptas qui consequatur quae sunt et consequa...,excepturi,1998-10-28 20:08:01
3,4,1,4,None,video,Est delectus tempora exercitationem atque temp...,vitae,2001-12-03 15:54:43
4,5,1,2,None,video,Est ducimus amet et asperiores. Reiciendis deb...,optio,1970-09-18 20:39:35
5,6,1,2,None,video,Quis cupiditate quis maxime et placeat consect...,laboriosam,1980-05-11 03:39:43
6,7,2,1,None,audio,Voluptatum nihil rem laboriosam delectus aperi...,sit,1988-08-19 10:30:44
7,8,2,4,None,audio,Nemo eos sed aspernatur voluptates perspiciati...,consectetur,1984-06-28 16:22:44
8,9,4,5,None,audio,Quod nihil possimus id qui. Quasi officia reru...,repellat,1981-12-11 16:04:11
9,10,3,1,None,text,Qui voluptatem earum temporibus rem vel sequi....,nihil,1988-02-16 13:29:14
10,11,3,2,None,image,Rem et ullam cum vitae autem reprehenderit qui...,et,2015-04-07 18:02:42

In [701]:
# удаляем сообщения от пользователя номер 1 к пользователю номер 2
delete_query = """
DELETE FROM private_messages
WHERE sender_id = 1 AND receiver_id IN (2, 4) OR sender_id = 2;"""

push(delete_query)

Succesfully connect
####################
DELETE FROM succesfully

In [702]:
pd.DataFrame(push("SELECT * FROM private_messages"))

Succesfully connect
####################
SELECT * succesfully

,id,sender_id,receiver_id,reply_to_id,media_type,body,filename,created_at
0,3,1,3,None,text,Voluptas qui consequatur quae sunt et consequa...,excepturi,1998-10-28 20:08:01
1,9,4,5,None,audio,Quod nihil possimus id qui. Quasi officia reru...,repellat,1981-12-11 16:04:11
2,10,3,1,None,text,Qui voluptatem earum temporibus rem vel sequi....,nihil,1988-02-16 13:29:14
3,11,3,2,None,image,Rem et ullam cum vitae autem reprehenderit qui...,et,2015-04-07 18:02:42

In [703]:
# пробуем удалить пользователя номер 3
push("""DELETE FROM users
WHERE id = 3;""")

Succesfully connect
####################
Connection refused...
(1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`stepik`.`channel_subscribers`, CONSTRAINT `channel_subscribers_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`))')

In [704]:
# сначала удаляем его подписки на каналы
push("""DELETE FROM channel_subscribers
WHERE user_id = 3;""")

Succesfully connect
####################
DELETE FROM succesfully

In [705]:
# удаляем сообщения пользователя номер 3
push("""DELETE FROM private_messages
WHERE sender_id = 3 OR receiver_id = 3;""")

Succesfully connect
####################
DELETE FROM succesfully

In [706]:
# добавим флаг для удаленных сообщений (вместо физического удаления строк)
push("ALTER TABLE private_messages ADD COLUMN is_deleted BIT NOT NULL DEFAULT 0;")

Succesfully connect
####################
ALTER TABLE succesfully

In [707]:
# отмечаем сообщения удаленными
push("""UPDATE private_messages
SET is_deleted = 1
WHERE sender_id = 2 AND receiver_id = 1;""")

Succesfully connect
####################
UPDATE private_messages succesfully

In [708]:
pd.DataFrame(push("SELECT * FROM private_messages"))

Succesfully connect
####################
SELECT * succesfully

,id,sender_id,receiver_id,reply_to_id,media_type,body,filename,created_at,is_deleted
0,9,4,5,None,audio,Quod nihil possimus id qui. Quasi officia reru...,repellat,1981-12-11 16:04:11,b'\x00'

## 3.5 Сервисы для генерации данных

Сервисы для генерации данных: <br>
http://filldb.info/ <br>
http://www.generatedata.com/ <br>
https://sourceforge.net/p/benerator/wiki/Home/ <br>
http://www.dominicgiles.com/datagenerator.html <br>

# 4 Основы SELECT запросов

## 4.1 Фильтрация (WHERE + LIKE)

In [709]:
# Данные пользователя 
select_query = """
SELECT *
FROM users
WHERE id = 1;"""

display(pd.DataFrame(push(select_query)))

select_query = """
SELECT *
FROM profiles
WHERE user_id = 1;"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT * succesfully

,id,firstname,lastname,login,email,password_hash,phone,is_deleted
0,1,Kelsie,Olson,None,xheidenreich@example.net,None,9548492646,b'\x00'

Succesfully connect
####################
Connection refused...
(1146, "Table 'stepik.profiles' doesn't exist")

Empty DataFrame
Columns: []
Index: []

In [710]:
# Все каналы со словом 'sql' в названии
select_query = """
SELECT *
FROM channels 
WHERE  title LIKE '%sql%';"""

display(pd.DataFrame(push(select_query)))

select_query = """
SELECT *
FROM channels 
WHERE  title LIKE '%SQL%';"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT * succesfully

,id,title,icon,invite_link,settings,owner_user_id,is_private,created_at
0,1,General SQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:44:28
1,2,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:46:10
2,3,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:46:35
3,4,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:46:49
4,5,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:54:59
5,6,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:56:35
6,7,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 21:11:15
7,8,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 21:18:27

Succesfully connect
####################
SELECT * succesfully

,id,title,icon,invite_link,settings,owner_user_id,is_private,created_at
0,1,General SQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:44:28
1,2,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:46:10
2,3,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:46:35
3,4,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:46:49
4,5,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:54:59
5,6,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:56:35
6,7,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 21:11:15
7,8,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 21:18:27

In [711]:
# Уточним регистр букв при фильтрации
select_query = r"""
SELECT *
FROM channels 
WHERE  title COLLATE utf8mb4_0900_as_cs LIKE '%sql%';"""

display(pd.DataFrame(push(select_query)))

select_query = """
SELECT *
FROM channels 
WHERE  title COLLATE utf8mb4_0900_as_cs LIKE '%SQL%';"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT * succesfully

Empty DataFrame
Columns: []
Index: []

Succesfully connect
####################
SELECT * succesfully

,id,title,icon,invite_link,settings,owner_user_id,is_private,created_at
0,1,General SQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:44:28
1,2,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:46:10
2,3,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:46:35
3,4,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:46:49
4,5,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:54:59
5,6,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 20:56:35
6,7,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 21:11:15
7,8,MySQL news,None,https://t.me/mysql_news,None,1,b'\x01',2025-03-12 21:18:27

In [712]:
# Пользователи с именами на букву ‘K’
select_query = """
SELECT *
FROM users 
WHERE firstname LIKE 'K%';"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT * succesfully

,id,firstname,lastname,login,email,password_hash,phone,is_deleted
0,1,Kelsie,Olson,None,xheidenreich@example.net,None,9548492646,b'\x00'

In [713]:
# Пользователи с фамилией из 4 букв
select_query = """
SELECT *
FROM users 
WHERE firstname LIKE '____';"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT * succesfully

,id,firstname,lastname,login,email,password_hash,phone,is_deleted
0,5,Lori,Koch,None,damaris34@example.net,None,9192291407,b'\x00'
1,100,Sam2,Kuphal2,None,telly.miller222@example.net,None,9917826222,b'\x00'

## 4.2 Сортировка (ORDER BY)

In [724]:
# Генерация данных
insert_query = """
INSERT INTO `private_messages`(sender_id, receiver_id, media_type, body, filename, created_at)
VALUES
(1,2,'text','Eveniet suscipit ullam occaecati consequatur hic. Nulla est in molestiae odit. Placeat perferendis consequatur qui omnis id vel autem.','officiis','2010-04-07 09:01:02'),
(2,1,'audio','Non repudiandae maiores molestiae vel doloribus. Quis facere blanditiis est magnam est ut vero.','qui','1971-05-29 07:31:20'),
(1,3,'text','Voluptas qui consequatur quae sunt et consequatur. Rem alias sed cupiditate explicabo voluptate. Officiis repellat porro accusamus eveniet quos. Laborum dolores sed enim aut.','excepturi','1998-10-28 20:08:01'),
(1,4,'video','Est delectus tempora exercitationem atque tempora reiciendis nulla voluptatem. Cupiditate non fugit blanditiis quasi ad et autem expedita. Aut est provident odio quasi possimus.','vitae','2001-12-03 15:54:43'),
(1,2,'video','Est ducimus amet et asperiores. Reiciendis debitis qui ipsa. Nemo laboriosam ea aut omnis voluptates quisquam accusantium. Quibusdam totam similique aut.','optio','1970-09-18 20:39:35'),
(1,2,'video','Quis cupiditate quis maxime et placeat consectetur ut quis. Voluptas unde voluptatem deserunt in dolorum maxime. Sunt fugiat sit tenetur placeat at.','laboriosam','1980-05-11 03:39:43'),
(2,1,'audio','Voluptatum nihil rem laboriosam delectus aperiam consequuntur et modi. Laudantium molestias corporis quo omnis ut ea. At minima iure et voluptatum culpa deleniti non. Sint laboriosam molestias dolor vel. Quibusdam omnis quas ullam dolor.','sit','1988-08-19 10:30:44'),
(2,4,'audio','Nemo eos sed aspernatur voluptates perspiciatis tenetur. Voluptas sunt magnam vero nam earum. Magnam eum vitae qui. Vel atque accusantium in non rem non et.','consectetur','1984-06-28 16:22:44'),
(4,5,'audio','Quod nihil possimus id qui. Quasi officia rerum eum doloribus est voluptas maxime. Et debitis enim non enim fugit.','repellat','1981-12-11 16:04:11'),
(3,1,'text','Qui voluptatem earum temporibus rem vel sequi. Et quasi vel qui est autem aliquam. Modi est voluptatem aut rerum ea velit. Voluptate et eligendi debitis nostrum nihil dolorum.','nihil','1988-02-16 13:29:14'),
(3,2,'image','Rem et ullam cum vitae autem reprehenderit quia. Enim a ipsam id ut aliquam est error. Quis dolorum omnis expedita eaque maiores illo.','et','2015-04-07 18:02:42')
;"""
push(insert_query)

Succesfully connect
####################
INSERT INTO succesfully

In [725]:
# личные сообщения
select_query = """
SELECT *
FROM private_messages 
WHERE sender_id = 1;"""

display(pd.DataFrame(push(select_query)))

select_query = """
SELECT *
FROM private_messages 
WHERE receiver_id = 1;"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT * succesfully

,id,sender_id,receiver_id,reply_to_id,media_type,body,filename,created_at,is_deleted,is_read
0,12,1,2,None,text,Eveniet suscipit ullam occaecati consequatur h...,officiis,2010-04-07 09:01:02,b'\x00',b'\x00'
1,14,1,3,None,text,Voluptas qui consequatur quae sunt et consequa...,excepturi,1998-10-28 20:08:01,b'\x00',b'\x00'
2,15,1,4,None,video,Est delectus tempora exercitationem atque temp...,vitae,2001-12-03 15:54:43,b'\x00',b'\x00'
3,16,1,2,None,video,Est ducimus amet et asperiores. Reiciendis deb...,optio,1970-09-18 20:39:35,b'\x00',b'\x00'
4,17,1,2,None,video,Quis cupiditate quis maxime et placeat consect...,laboriosam,1980-05-11 03:39:43,b'\x00',b'\x00'

Succesfully connect
####################
SELECT * succesfully

,id,sender_id,receiver_id,reply_to_id,media_type,body,filename,created_at,is_deleted,is_read
0,13,2,1,None,audio,Non repudiandae maiores molestiae vel doloribu...,qui,1971-05-29 07:31:20,b'\x00',b'\x00'
1,18,2,1,None,audio,Voluptatum nihil rem laboriosam delectus aperi...,sit,1988-08-19 10:30:44,b'\x00',b'\x00'
2,21,3,1,None,text,Qui voluptatem earum temporibus rem vel sequi....,nihil,1988-02-16 13:29:14,b'\x00',b'\x00'

In [726]:
# диалог между user_id = 1 и user_id = 2
select_query = """
SELECT *
FROM private_messages 
WHERE sender_id = 1 AND receiver_id = 2 
    OR sender_id = 2 AND receiver_id = 1
ORDER BY created_at desc;"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT * succesfully

,id,sender_id,receiver_id,reply_to_id,media_type,body,filename,created_at,is_deleted,is_read
0,12,1,2,None,text,Eveniet suscipit ullam occaecati consequatur h...,officiis,2010-04-07 09:01:02,b'\x00',b'\x00'
1,18,2,1,None,audio,Voluptatum nihil rem laboriosam delectus aperi...,sit,1988-08-19 10:30:44,b'\x00',b'\x00'
2,17,1,2,None,video,Quis cupiditate quis maxime et placeat consect...,laboriosam,1980-05-11 03:39:43,b'\x00',b'\x00'
3,13,2,1,None,audio,Non repudiandae maiores molestiae vel doloribu...,qui,1971-05-29 07:31:20,b'\x00',b'\x00'
4,16,1,2,None,video,Est ducimus amet et asperiores. Reiciendis deb...,optio,1970-09-18 20:39:35,b'\x00',b'\x00'

In [727]:
#	непрочитанные сообщения

# добавим колонку is_read DEFAULT FALSE
add_column_query = """
ALTER TABLE private_messages
ADD COLUMN is_read BIT DEFAULT false NOT NULL;"""

push(add_column_query)

Succesfully connect
####################
Connection refused...
(1060, "Duplicate column name 'is_read'")

In [728]:
# сколько у меня непрочитанных сообщений от пользователя Х
select_query = """
SELECT COUNT(*)
FROM private_messages 
WHERE sender_id = 2 and receiver_id = 1
	AND is_read = 0;"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT COUNT(*) succesfully

   COUNT(*)
0         2

In [729]:
# сколько у меня всего непрочитанных сообщений
select_query = """
SELECT COUNT(*)
FROM private_messages 
WHERE receiver_id = 1 
	AND is_read = 0;"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT COUNT(*) succesfully

   COUNT(*)
0         3

In [730]:
# отметим сообщения, как прочитанные
# эмулируем ситуацию, что пользователь прочитал определенный диалог

update_query = """
UPDATE private_messages
SET is_read = 1
WHERE receiver_id = 1 AND sender_id = 2;"""

push(update_query)

Succesfully connect
####################
UPDATE private_messages succesfully

In [731]:
# сколько у меня всего непрочитанных сообщений
select_query = """
SELECT COUNT(*)
FROM private_messages 
WHERE receiver_id = 1 
	AND is_read = 0;"""

display(pd.DataFrame(push(select_query)))

Succesfully connect
####################
SELECT COUNT(*) succesfully

   COUNT(*)
0         1

## 4.3 Агрегирующие функции (COUNT, MIN, MAX, AVG, SUM)

In [ ]:
# диалог между user_id = 1 и user_id = 2
SELECT *
FROM private_messages 
WHERE (sender_id = 1 AND receiver_id = 2 
    OR sender_id = 2 AND receiver_id = 1) AND media_type = 'image'
;

# сколько у меня непрочитанных сообщений от пользователя Х
SELECT COUNT(*)
from private_messages 
WHERE sender_id = 29 AND receiver_id = 1
	AND is_read = 0;


# сколько у меня всего непрочитанных сообщений 
SELECT COUNT(*)
FROM private_messages 
WHERE receiver_id = 1 
	AND is_read = 0;


# COUNT, MIN, MAX, AVG, SUM
# год рождения каждого пользователя
SELECT YEAR(birthday)
FROM users;

# год рождения самого старшего пользователя
SELECT MIN(YEAR(birthday))
FROM users;

# год рождения самого младшего пользователя
SELECT MAX(YEAR(birthday))
FROM users;

# среднее значение года рождения
SELECT AVG(YEAR(birthday))
FROM users;

# округлим предыдущее значение
SELECT ROUND(AVG(YEAR(birthday)))
FROM users;

# сумма, потраченная на покупки покупателем номер 1
# запрос к БД sakila
SELECT SUM(amount)
FROM sakila.payment
WHERE customer_id = 1;

## 4.4 Группировка (GROUP BY)

## 4.5 Фильтрация (HAVING)

## 4.6 Отсутствие значения (NULL)

## 4.7 Пейджинг (LIMIT + OFFSET)

## 4.8 Условия, ветвления (IF, CASE)